//Terneary operator
//دستور شرطی که تو اکما اسکریپت  شیش اومد 
//عمل گر سه تایی سه گانه هم بهش میگن

// let age = 25
//// if else
// if (age > 18){
//     //کدهایی که درصورت درست بودن شرط
//     alert('سن از 18  بزرگتر است')
// }else{
//     //کدهایی که درصورت درست نبودن شرط
//     alert('سن از 18  کوچکتر است')
// }

////terneary operator
// let age = 25
// age > 18 ? alert('سن از 18 بزرگتر است') : alert('سن از 18 کوچکتر است')


// ------------------------------ back-tics syntax -----------------
//Template Literals
//Template String
//Back-Tics Syntax

//درواقع این سه تا دارن به یه موضوع اشاره میکنند اگه سایتای مختلف دیدین هر سه یه چیزن
//که در اکما اسکریپت شیش  این ` ` اومد
//برای نمایش دادن رشته ها استفاده میشه همونطور که میدونیم میتونم از " " و ' ' استفاده کنیم
// و هم از بک تیک ` `  هلا این تفاوتش چیه؟ وقتی بخوایم کد ج اس داخل یه استرینگ بنویس
//نکته دوم هرطور که داخل بکتیک بنویسم تو خروجی هم همینطوره یعنی اگه فاصله یا اینتر داشته باشیم هم همونطوری نشون داده میشه

// console.log(`milad 
// bahrami
// `);

// let name = 'milad'
// let age = 26
// console.log(`is ${name} age:${age}`);


// ------------------------ module consept ------------
//معنی ماژول   یعنی قطعه بخش فرض کنید که شما یه کتاب از فصل های مختلفی درست شده 
// همونطور که یه کتاب به بخش ها مختلفی تقسیم شده یه برنامه جی اس هم میتونه به بخش های مختلفی تقسیم بشه
// که به هرکدوم از اون بخش یا قطعه میگیم ماژول پس ماژول یه قطعه یا بخش از یه چیز بزرگتره
//وقتی کد های برنامه ما زیاد میشه  دیگه نمیتونیم همه کد ها روداخل یه فایل قرار بدیم 
//چون نگهداری وتوسعه برنامه رو کم میکنه راه حل اینه که برنامه مون رو به قسمت های کوچکتر تبدیل کنیم

// نکته!
//مبحث ماژول ها چون باید داخل چند فایل جی اس داشته باشیم و درک بهتر این قسمت های این فصل دیده شود


//---------------- arrow function ------------------

// const myFunc = (sum1 , sum2)=>{
//     return sum1 + sum2;
// }
// console.log(myFunc(10 , 15));

// اگه فقط یه مقدار وردی داشته باشیم میتونیم اون پرانتز ها رو هم حذف کنیم
// اگه فقط یک خط کد ساده داشته باشیم میتونیم اون برکت ها رو هم برداریم

// const myFunc2 = name => `name : ${name}`;
// console.log(myFunc2('ali'));

//اگه بخوایم داخل  اون ارو فانکشن مون تو یه خط یا چند خط یه چیزی رو ریترن کنیم اینطوری مینویسم
// این پرانتز رو میزاریم تا فکر نکنه مفسر جی اس که این براکت ابجیکت مال اون ریترن نیست و این کد ریترن بشه
// const myFunc3 = ()=> ( {id: 1 , firstName : 'ali'} );
// console.log(myFunc3());