//Terneary operator
//دستور شرطی که تو اکما اسکریپت  شیش اومد 
//عمل گر سه تایی سه گانه هم بهش میگن

// let age = 25
//// if else
// if (age > 18){
//     //کدهایی که درصورت درست بودن شرط
//     alert('سن از 18  بزرگتر است')
// }else{
//     //کدهایی که درصورت درست نبودن شرط
//     alert('سن از 18  کوچکتر است')
// }

////terneary operator
// let age = 25
// age > 18 ? alert('سن از 18 بزرگتر است') : alert('سن از 18 کوچکتر است')


// ------------------------------ back-tics syntax -----------------
//Template Literals
//Template String
//Back-Tics Syntax

//درواقع این سه تا دارن به یه موضوع اشاره میکنند اگه سایتای مختلف دیدین هر سه یه چیزن
//که در اکما اسکریپت شیش  این ` ` اومد
//برای نمایش دادن رشته ها استفاده میشه همونطور که میدونیم میتونم از " " و ' ' استفاده کنیم
// و هم از بک تیک ` `  هلا این تفاوتش چیه؟ وقتی بخوایم کد ج اس داخل یه استرینگ بنویس
//نکته دوم هرطور که داخل بکتیک بنویسم تو خروجی هم همینطوره یعنی اگه فاصله یا اینتر داشته باشیم هم همونطوری نشون داده میشه

console.log(`milad 
bahrami
`);

let name = 'milad'
let age = 26
console.log(`is ${name} age:${age}`);
